NXP/els_pkc/src/platforms/mcxn10/inc/ip_platform.h
/*--------------------------------------------------------------------------*/
/* Copyright 2020-2022 NXP                                                  */
/*                                                                          */
/* All rights are reserved. Reproduction in whole or in part is prohibited  */
/* without the prior written consent of the copy-right owner.               */
/* This source code and any compilation or derivative thereof is the sole   */
/* property of NXP N.V. and is provided pursuant to a Software License      */
/* Agreement. This code is the proprietary information of NXP N.V. and      */
/* is confidential in nature. Its use and dissemination by any party other  */
/* than NXP N.V. is strictly limited by the confidential information        */
/* provisions of the agreement referenced above.                            */
/*--------------------------------------------------------------------------*/

/** @file  ip_platform.h
 *  @brief Include file for the IP.
 *
 * This includes the CMSIS for all of the functionality provided by the CSSv2 IP and provides support for external base address linking. */

#ifndef IP_PLATFORM_H
#define IP_PLATFORM_H

#include <MCXN947_cm33_core0.h>

/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

#define CSS_Type S50_Type
#define CSS ELS

#define PKC PKC0

// Define base address of CSS
#define CSS_SFR_BASE            S50         ///< base of CSS SFRs
#define CSS_SFR_NAME(sfr)       sfr         ///< full name of SFR
#define CSS_SFR_PREFIX          S50_        ///< sfr field name prefix

// Define base address of PKC
#define PKC_SFR_BASE            PKC0        ///< base of PKC SFRs
#define PKC_SFR_NAME(sfr)       PKC_ ## sfr ///< full name of SFR
#define PKC_SFR_PREFIX          PKC_PKC_    ///< sfr field name prefix
#define PKC_SFR_SUFFIX_MSK      _MASK       ///< sfr field name suffix for mask
#define PKC_SFR_SUFFIX_POS      _SHIFT      ///< sfr field name suffix for bit position

// PKC_RAM base address is not defined in any header file
#define PKC_RAM_ADDR  ((uint32_t)0x400B3000u)
#define PKC_RAM_SIZE  ((uint32_t)0x1000u)

#define PKC_WORD_SIZE  8u

// Define base address of TRNG
#define TRNG_SFR_BASE           TRNG0       ///< base of TRNG SFRs
#define TRNG_SFR_NAME(sfr)      sfr         ///< full name of SFR
#define TRNG_SFR_PREFIX         TRNG_       ///< sfr field name prefix
#define TRNG_SFR_SUFFIX_MSK     _MASK       ///< sfr field name suffix for mask
#define TRNG_SFR_SUFFIX_POS     _SHIFT      ///< sfr field name suffix for bit position


// CSS interrupt definitions
#define CSS_INTERRUPT_ERR_NUMBER   CSS_IRQn
#define CSS_INTERRUPT_IRQ_NUMBER   CSS_ERR_IRQn
//#define CSS_INTERRUPT_BUSY_NUMBER  // not supported


#define IP_PUF_BASE      0x5002C000UL
#define PUF_SRAM_CFG     *(volatile uint32_t *) (IP_PUF_BASE + 0x300)
#define PUF_SR           *(volatile uint32_t *) (IP_PUF_BASE + 0x8)
#define PUF_OR           *(volatile uint32_t *) (IP_PUF_BASE + 0x4)
#define PUF_CR           *(volatile uint32_t *) (IP_PUF_BASE + 0x0)
#define PUF_KEY_DEST     *(volatile uint32_t *) (IP_PUF_BASE + 0x20)
#define PUF_DIR          *(volatile uint32_t *) (IP_PUF_BASE + 0xA0)
#define PUF_DOR          *(volatile uint32_t *) (IP_PUF_BASE + 0xA8)


#define NXPCLCSS_HW_VERSION_REVISION            0
#define NXPCLCSS_HW_VERSION_MINOR               4
#define NXPCLCSS_HW_VERSION_MAJOR               3
#define NXPCLCSS_HW_VERSION_FW_REVISION         0
#define NXPCLCSS_HW_VERSION_FW_MINOR            4
#define NXPCLCSS_HW_VERSION_FW_MAJOR            2


#ifdef NXPCL_FEATURE_CSSV2_LINK_BASE_ADDRESS
/* If we are supposed to determine the CSSv2 base address at link time, do not use the definitions from the platform header file
 * Redefine IP_CSS as an extern pointer.
 */
#undef CSS_SFR_BASE
extern void * ip_css_base;
#define CSS_SFR_BASE           ((S50_Type *) ip_css_base)
#endif /* NXPCL_FEATURE_CSSV2_LINK_BASE_ADDRESS */

#endif
